#-----------------------------------------------------------------------------
# Create Python Version : 3.6
#-----------------------------------------------------------------------------
# -*- utf-8 -*-

#-----------------------------------------------------------------------------
# stopwatch.py
#-----------------------------------------------------------------------------

import sys
import time

#-----------------------------------------------------------------------------
class Stopwatch():
    def __init__(self):
        """
            コンストラクタ
        """
        self.__elapsed_time = 0
        self.__creation_time = 0

    @property
    def elapsed_time(self):
        """
            計測時間
        """
        return self.__elapsed_time

    # 計測開始
    def start(self):
        """
           現在時間を保持します。
        """
        self.__creation_time = time.time()

    # 計測終了
    def end(self):
        """
           保持している時間から、現在時間を引いた時間を計測時間とします。
        """
        self.__elapsed_time = time.time() - self.__creation_time
        return self.__elapsed_time 

#-----------------------------------------------------------------------------
# テスト用
#-----------------------------------------------------------------------------
if __name__ ==  '__main__':
    sw = Stopwatch()
    sw.start()
    for i in range(1, 1000):
        print('count {0:d}'.format(i))


    